{
    "1 Boiled Egg with Black Pepper": 3,
    "1 Small Date with Soaked Almonds": 4,
    "Ajwain Water": 5,
    "Ajwain Water (for digestion)": 6,
    "Almond Milk with Nutmeg": 7,
    "Aloe Vera Juice": 8,
    "Aloo Baingan with Roti and Sprouts Salad": 9,
    "Aloo Gajar Matar": 10,
    "Aloo Gobi with Phulka and Raita": 11,
    "Aloo Matar": 12,
    "Aloo Matar with Roti and Boiled Sprouts": 13,
    "Aloo Paratha": 14,
    "Aloo Sabzi": 15,
    "Aloo Tamater Sabzi": 16,
    "Aloo Tikki": 17,
    "Amla Juice (Indian Gooseberry)": 18,
    "Amla Juice (diluted)": 19,
    "Appam with Veg Stew (light coconut)": 20,
    "Apple (with skin)": 21,
    "Apple + Almond Butter": 22,
    "Apple Juice": 23,
    "Apple slices with cinnamon": 24,
    "Arbi Bhujia": 25,
    "Ash Gourd Juice": 26,
    "Ash Gourd Juice (Petha Juice)": 27,
    "Ashwagandha Milk": 28,
    "Baingan Bharta": 29,
    "Baingan Bharta with Jowar Roti": 30,
    "Bajra Khichdi (lightly spiced)": 31,
    "Bajra Khichdi with Veggies": 32,
    "Bajra Roti with Baingan Bharta": 33,
    "Bajra Roti with Moong Dal": 34,
    "Banana": 35,
    "Banana (small)": 36,
    "Banana Almond Smoothie (no sugar)": 37,
    "Banana Juice": 38,
    "Banana with 1 tsp Peanut Butter": 39,
    "Batata Vada": 40,
    "Beetroot Poriyal with Roti and Tur Dal": 41,
    "Besan Cheela with Mint Chutney": 42,
    "Besan Chilla (without oil)": 43,
    "Besan Chilla with Curd": 44,
    "Besan Chilla with Veggies": 45,
    "Besan Gatta Curry with Bajra Roti and Raita": 46,
    "Bharwa Karela with Jowar Roti and Curd": 47,
    "Bhel Puri": 48,
    "Bhindi Fry": 49,
    "Bhindi Masala": 50,
    "Bhindi Masala with Bajra Roti and Boiled Moong Salad": 51,
    "Bhindi Masala with Jowar Roti": 52,
    "Bhindi Masala with Phulka Roti": 53,
    "Boiled Chole with Lemon & Onion": 54,
    "Boiled Corn with lemon and salt": 55,
    "Boiled Egg": 56,
    "Boiled Egg + Whole Wheat Toast": 57,
    "Boiled Kala Chana with Lemon": 58,
    "Boiled Soybeans": 59,
    "Boiled Sprouts with spices": 60,
    "Boiled Sweet Potato (Small Piece)": 61,
    "Boiled Sweet Potato Chaat": 62,
    "Boiled Sweet Potato with Chaat Masala": 63,
    "Bottle Gourd Kofta Curry with Bajra Roti": 64,
    "Bottlegourd Curry with Rice and Moong Sprouts": 65,
    "Brown Rice Khichdi with Veg Raita": 66,
    "Buttermilk with Jeera": 67,
    "Buttermilk with Roasted Jeera": 68,
    "Cabbage Moong Dal Curry with Brown Rice": 69,
    "Cabbage Paratha with Mint Yogurt": 70,
    "Cabbage Peas Sabzi with Roti and Buttermilk": 71,
    "Cabbage Peas Stir Fry with Bajra Roti": 72,
    "Cabbage-Moong Dal Paratha (light ghee)": 73,
    "Carrot Beans Curry with Rice and Kadhi": 74,
    "Chamomile Tea": 75,
    "Chamomile Tea with 5 Soaked Almonds": 76,
    "Chana": 77,
    "Chana Dal with Paratha and Cucumber Salad": 78,
    "Chana Masala with Quinoa": 79,
    "Chana Masala with Whole Wheat Roti": 80,
    "Chana Soaked (Black Chickpeas)": 81,
    "Chia Seeds in water (soaked overnight)": 82,
    "Chia seed pudding (unsweetened, small portion)": 83,
    "Chicken Biryani": 84,
    "Chicken Curry": 85,
    "Chicken Tikka": 86,
    "Chole Masala": 87,
    "Chole with Multigrain Roti and Onion Salad": 88,
    "Cinnamon Tea (No Caffeine)": 89,
    "Cinnamon Water (Warm)": 90,
    "Coconut Water": 91,
    "Coconut Water with Mint": 92,
    "Coriander Seeds Water": 93,
    "Cow's milk": 94,
    "Cucumber Raita": 95,
    "Cucumber Slices with Rock Salt": 96,
    "Cucumber slices with lemon": 97,
    "Cumin Seed Water (Jeera Water)": 98,
    "Curd Rice with Pickle and Papad": 99,
    "Dahi": 100,
    "Dahi Bhindi with Jeera Rice and Salad": 101,
    "Dahi Puri": 102,
    "Dal Tadka with Brown Rice": 103,
    "Dal Tadka with Jeera Rice and Cucumber Raita": 104,
    "Dal bati": 105,
    "Dalia (Broken Wheat Porridge)": 106,
    "Dalia Khichdi with Buttermilk": 107,
    "Dates": 108,
    "Dates (1-2)": 109,
    "Dhokla": 110,
    "Dhokla with Coriander Chutney": 111,
    "Dhokla with Mint Chutney and Vegetable Upma": 112,
    "Dry fig (anjeer)": 113,
    "Egg Bhurji": 114,
    "Egg Bhurji with Multigrain Roti": 115,
    "Egg Curry": 116,
    "Fish Curry": 117,
    "Fish Fry": 118,
    "Flavored Curd with Banana": 119,
    "Flax seeds roasted": 120,
    "Flaxseeds water (soaked overnight)": 121,
    "Gatte Ki sabzi": 122,
    "Giloy Juice": 123,
    "Ginger Tea (no milk/sugar)": 124,
    "Gobi Masala": 125,
    "Gobi Paratha": 126,
    "Greek Yogurt (Unsweetened)": 127,
    "Greek Yogurt with Honey + Flaxseeds": 128,
    "Green Gram (Chilka Moong) Soup": 129,
    "Grilled Paneer with Sauteed Vegetables": 130,
    "Groundnut Chikki": 131,
    "Guava (small, ripe)": 132,
    "Guava with Black Salt": 133,
    "Half Methi Thepla": 134,
    "Halwa": 135,
    "Herbal Tea with 2 Nuts": 136,
    "Homemade Curd": 137,
    "Homemade Fruit Yogurt": 138,
    "Hummus with Multigrain Bread": 139,
    "Idli": 140,
    "Idli Sambhar": 141,
    "Jeera Water (Cumin Water)": 142,
    "Jowar Porridge with Milk": 143,
    "Jowar Roti with Palak Bhaji": 144,
    "Jowar Upma": 145,
    "Kachori": 146,
    "Kadai Paneer": 147,
    "Kaddu Sabzi": 148,
    "Kadhi Pakora with Rice and Stir-Fried Beans": 149,
    "Kadhi with Bajra Roti": 150,
    "Kaju Curry": 151,
    "Kala Chana Curry with Bajra Roti": 152,
    "Kale Chane Curry with Red Rice": 153,
    "Karela (Bitter Gourd) Stuffed with Masala and Roti": 154,
    "Karela Masala with Multigrain Roti and Curd": 155,
    "Karela Sabzi": 156,
    "Khakhra": 157,
    "Khaman Dhokla (low oil)": 158,
    "Khaman Dhokla with Green Chutney": 159,
    "Kheer": 160,
    "Khichdi with Moong Dal (thin consistency)": 161,
    "Lachha Paratha": 162,
    "Lauki Chana Dal with Brown Rice and Beetroot Salad": 163,
    "Lauki Curry with Steamed Rice": 164,
    "Lauki Sabzi": 165,
    "Lemon Rice with Coconut Chutney": 166,
    "Lentil Broth (Light)": 167,
    "Lettuce-Curd Salad (Lightly Spiced)": 168,
    "Licorice Root Tea (Mulethi)": 169,
    "Lobia Curry with Rice and Ghia Sabzi": 170,
    "Low-Fat Warm Milk with 1 Date": 171,
    "Low-Fat Yogurt with Flax Seeds": 172,
    "Low-fat Curd with Flaxseeds": 173,
    "Low-fat paneer cubes (small portion)": 174,
    "Low-fat plain curd": 175,
    "Lukewarm Milk with Cardamom Powder": 176,
    "Lukewarm Water with Lemon & Honey": 177,
    "Mango Juice": 178,
    "Masala Buttermilk (low salt)": 179,
    "Masala Chana with Cucumber": 180,
    "Masala Corn": 181,
    "Masala Dosa": 182,
    "Masala Omelette with Veggies": 183,
    "Mashed Pumpkin with Herbs": 184,
    "Mashed Sweet Potato (small portion)": 185,
    "Masoor Dal Soup (Small Bowl)": 186,
    "Masoor Dal with Jeera Rice": 187,
    "Masoor Dal with Steamed Brown Rice": 188,
    "Matar Paneer with Roti and Carrot-Cucumber Salad": 189,
    "Mater Paneer": 190,
    "Methi Aloo": 191,
    "Methi Aloo with Jowar Roti": 192,
    "Methi Paratha": 193,
    "Methi Thepla with Low Fat Curd": 194,
    "Methi Water (Fenugreek Soaked Water)": 195,
    "Milk with Soaked Almonds": 196,
    "Mini Idli with Podi": 197,
    "Mini Khakhra": 198,
    "Mini Oats Cheela": 199,
    "Mint Chaas": 200,
    "Misal Pav": 201,
    "Missi Roti with Baingan Bharta": 202,
    "Mix Dal with Brown Rice and Stir Fried Veg": 203,
    "Mix Veg": 204,
    "Mix Veg Curry with Millet Roti": 205,
    "Mix Veg Curry with Rice and Sprouted Moong": 206,
    "Mix Veg Paratha": 207,
    "Mixed Berries": 208,
    "Mixed Dal Dosa (Adai)": 209,
    "Mixed Sprouts with tomato and onion": 210,
    "Mixed Veg Salad": 211,
    "Mooli Paratha": 212,
    "Mooli Sabzi": 213,
    "Moong Dal Cheela with Curd": 214,
    "Moong Dal Chilla": 215,
    "Moong Dal Chilla with Mint Chutney": 216,
    "Moong Dal Khichdi with Curd and Papad": 217,
    "Moong Dal Khichdi with Pickle and Raita": 218,
    "Moong Dal Pancake": 219,
    "Moong Dal Soup (Light and Thin)": 220,
    "Moong Dal Soup (Lightly Spiced)": 221,
    "Multigrain Roti with Lauki Sabzi": 222,
    "Multigrain Roti with Mixed Veg Sabzi": 223,
    "Multigrain Thepla with Curd": 224,
    "Musk melon cubes": 225,
    "Mutter Paneer with Phulka": 226,
    "Mutton Curry": 227,
    "Oats + Chia Seed Smoothie (vegan)": 228,
    "Oats Idli": 229,
    "Oats and Moong Dal Khichdi": 230,
    "Oats porridge with water/milk (unsweetened)": 231,
    "Oats with low-fat milk": 232,
    "Orange segments": 233,
    "Palak Paneer": 234,
    "Palak Paneer with Jeera Rice": 235,
    "Palak Paneer with Missi Roti and Mixed Veg Sabzi": 236,
    "Palak Paratha": 237,
    "Palak Soup (Light, No Cream)": 238,
    "Palak Tofu with Roti": 239,
    "Paneer Bhuna Masala with Rice and Tandoori Roti": 240,
    "Paneer Bhurji with Jowar Roti": 241,
    "Paneer Bhurji with Roti and Beet-Carrot Salad": 242,
    "Paneer Butter Masala with Roti and Onion Salad": 243,
    "Paneer Masala": 244,
    "Paneer Paratha": 245,
    "Paneer Tikka Masala with Multigrain Roti and Raita": 246,
    "Paneer Vegetable Wrap in Whole Wheat Roti": 247,
    "Paneer cubes with black pepper": 248,
    "Papaya + Pumpkin Seeds": 249,
    "Papaya cubes with lemon": 250,
    "Papaya slices": 251,
    "Patta Gobhi matar": 252,
    "Pav Bhaji": 253,
    "Plain Buttermilk with Roasted Cumin": 254,
    "Plain Moong Dal Sprouts (with lemon)": 255,
    "Plain Paratha": 256,
    "Plain Paratha with Chana Masala and Raita": 257,
    "Plain Rice with Masoor Dal and Gobi Sabzi": 258,
    "Poha": 259,
    "Poha with vegetables (minimal oil)": 260,
    "Pomegranate Seeds": 261,
    "Pumpkin Curry with Jowar Roti and Kachumber Salad": 262,
    "Pumpkin Seeds": 263,
    "Pumpkin Soup (No Cream, No Butter)": 264,
    "Pumpkin seeds": 265,
    "Quinoa Upma with Coconut Chutney": 266,
    "Quinoa Upma with Mint Chutney": 267,
    "Quinoa Upma with Mixed Vegetables": 268,
    "Ragi Dosa with Coconut Chutney": 269,
    "Ragi Dosa with Tomato Chutney": 270,
    "Ragi Idli with Coconut Chutney": 271,
    "Ragi Malt (Salted or Lightly Sweetened)": 272,
    "Ragi Malt Drink": 273,
    "Ragi Malt Drink (unsweetened)": 274,
    "Ragi Porridge": 275,
    "Ragi Porridge (without sugar)": 276,
    "Ragi Porridge with Milk (Light)": 277,
    "Rajma Masala": 278,
    "Rajma Masala with Brown Rice and Cabbage Sabzi": 279,
    "Rajma Tikki (grilled)": 280,
    "Rajma with Brown Rice": 281,
    "Rasam with Steamed Rice": 282,
    "Rava Idli with Coconut Chutney": 283,
    "Rice": 284,
    "Rice Flakes Chivda": 285,
    "Rice Water (Kanji)": 286,
    "Ridge Gourd Curry with Rice and Dahi": 287,
    "Roasted Chana": 288,
    "Roasted Flaxseeds": 289,
    "Roasted Fox Nuts (Makhana)": 290,
    "Roasted Fox Nuts (Makhana) with Ghee": 291,
    "Roasted Makhana": 292,
    "Roasted Moong Dal": 293,
    "Roasted Peanuts": 294,
    "Roasted Pumpkin Seeds": 295,
    "Roasted Soy Nuts": 296,
    "Roti with Mix Dal and Aloo Methi": 297,
    "Sabudana Khichdi": 298,
    "Sabudana Khichdi (light, no frying)": 299,
    "Saffron Milk (1-2 strands)": 300,
    "Samosa": 301,
    "Sattu Drink (Lukewarm, Unsweetened)": 302,
    "Sattu Drink (salt/lemon)": 303,
    "Sattu Drink with Lemon + Salt": 304,
    "Sattu Paratha with Curd": 305,
    "Scrambled Paneer Toast": 306,
    "Seasonal Fruit Bowl": 307,
    "Seasonal Fruit Bowl with Nuts": 308,
    "Sesame Seed Ladoo": 309,
    "Sev Puri": 310,
    "Sev Tamatar": 311,
    "Simla Mirch Aloo": 312,
    "Small Ragi Roti with chutney": 313,
    "Soaked Almonds": 314,
    "Soaked Almonds + Walnuts": 315,
    "Soaked Figs (Anjeer)": 316,
    "Soaked Raisins (Munakka)": 317,
    "Soaked Walnuts": 318,
    "Soft Dalia in Milk (Unsweetened)": 319,
    "Sooji (Rava) Milk Porridge (No Sugar)": 320,
    "Sooji Upma with Veggies": 321,
    "Soya Bhurji with Whole Wheat Roti": 322,
    "Soyabean Curry with Rice and Onion-Cucumber Salad": 323,
    "Spinach Corn Sabzi with Paratha and Buttermilk": 324,
    "Spinach Corn Sandwich (Grilled)": 325,
    "Sprouted Moong Curry with Roti": 326,
    "Sprouted Moong Salad": 327,
    "Sprouts Curry with Rice and Buttermilk": 328,
    "Sprouts Salad with Curd": 329,
    "Steamed Apple with Cinnamon": 330,
    "Steamed Beetroot cubes": 331,
    "Steamed Dhokla (2 pieces)": 332,
    "Steamed Idli (1-2 small)": 333,
    "Steamed Idli with Sambar": 334,
    "Steamed Pear with Clove": 335,
    "Steamed Veg Momos": 336,
    "Steamed Veg Momos with Schezwan Sauce": 337,
    "Steamed Veggie Bowl": 338,
    "Steamed apple slices with cinnamon": 339,
    "Steamed bottle gourd cubes (lauki)": 340,
    "Stuffed Capsicum with Roti and Salad": 341,
    "Stuffed Lauki with Roti": 342,
    "Stuffed Methi Paratha with Curd": 343,
    "Stuffed Moong Sprouts Paratha (light oil)": 344,
    "Stuffed Paratha with Vegetable Soup": 345,
    "Stuffed Veg Paratha with Raita": 346,
    "Tamatar Bhindi": 347,
    "Tandoori Chicken": 348,
    "Thepla": 349,
    "Thepla with Curd and Green Chutney": 350,
    "Til Chikki": 351,
    "Tinda Masala with Phulka": 352,
    "Tinda Masala with Roti and Mixed Dal": 353,
    "Tinda Sabzi with Chapati": 354,
    "Tinda Tamatar": 355,
    "Tinda masala": 356,
    "Tinde ki Sabzi with Roti and Boiled Chana": 357,
    "Tofu Bhurji with Multigrain Paratha and Mint Raita": 358,
    "Tofu Bhurji with Roti": 359,
    "Tofu Bhurji with Whole Wheat Toast": 360,
    "Tofu Curry with Quinoa": 361,
    "Tomato Rice with Cucumber Raita": 362,
    "Toor Dal with Broken Wheat (Dalia)": 363,
    "Tulsi + Ginger Herbal Tea": 364,
    "Tulsi Tea": 365,
    "Tulsi Water (boiled basil leaves)": 366,
    "Tur Dal with Red Rice and Bhindi Fry": 367,
    "Turmeric Milk (Haldi Doodh)": 368,
    "Unsweetened Lassi": 369,
    "Upma": 370,
    "Vada Pav": 371,
    "Veg Cheese Pizza": 372,
    "Veg Pulao with Boondi Raita and Papad": 373,
    "Vegetable Clear Soup": 374,
    "Vegetable Dalia": 375,
    "Vegetable Dalia Pulao": 376,
    "Vegetable Dhokla": 377,
    "Vegetable Handvo": 378,
    "Vegetable Handvo with Coconut Chutney": 379,
    "Vegetable Khichdi with Papad and Curd": 380,
    "Vegetable Kofta Curry with Jeera Rice": 381,
    "Vegetable Oats Upma": 382,
    "Vegetable Poha (with peanuts)": 383,
    "Vegetable Pulao with Curd and Mint Chutney": 384,
    "Vegetable Pulao with Raita and Salad": 385,
    "Vegetable Sabudana Khichdi (small portion)": 386,
    "Vegetable Sambar with Brown Rice": 387,
    "Vegetable Sandwich": 388,
    "Vegetable Sandwich (grilled, minimal butter)": 389,
    "Vegetable Stew with Appam": 390,
    "Vegetable Stew with Red Rice": 391,
    "Vegetable Stew with Rice and Coconut Chutney": 392,
    "Vegetable Suji Toast": 393,
    "Vegetable Thepla with Pickle": 394,
    "Vegetable Uttapam with Mint Chutney": 395,
    "Vegetable Uttapam with Tomato Chutney": 396,
    "Walnuts (2-3 halves)": 397,
    "Warm Almond Milk": 398,
    "Warm Turmeric Milk (Haldi Doodh)": 399,
    "Watermelon Cubes": 400,
    "Wheatgrass Juice": 401,
    "White Sauce Pasta": 402,
    "<pad>": 0,
    "<sos>": 1,
    "<eos>": 2
}